Feature: поиск пар слов на определенном расстоянии в файле


Scenario Outline: ошибка в количестве аргументов
  Given подготовили тестовый файл "<filename>"
  When запускаем приложение count_pairs.py с <number> аргументом(ами)
  Then получаем сообщение об ошибке с параметрами

  Examples: Files
  | filename       | number |
  | nalogi.txt     | 1      |
  | empty.txt      | 2      |
  | stat_141_1.txt | 3      |

Scenario: передача несуществующего файла
  Given ничего
  When запускаем приложение count_pairs.py с несуществующим файлом
  Then получаем сообщение об ошибке с файлом


Scenario: передача файла, закрытого на чтение
  Given подготовили закрытый файл "closed.txt"
  When ищем пару слов "dirb" и "sun" на расстоянии 10
  Then получаем сообщение об ошибке с файлом

Scenario Outline: передача пустого файла
  Given подготовили тестовый файл "empty.txt"
  When ищем пару слов "<firstW>" и "<secondW>" на расстоянии <dist>
  Then находим 0 таких пар в тестовом файле

  Examples: Paires
  | firstW  | secondW | dist |
  | налог   | Россия  | 0    |
  | налог   | России  | 1    |
  | ставка  | налогу  | 100  |
  | доход   | доход   | 0    | 
  | доход   | доход   | 5    | 

Scenario Outline: поиск соседних слов
  Given подготовили тестовый файл "stat_141_1.txt"
  When ищем пару слов "<firstW>" и "<secondW>" на расстоянии 0
  Then находим <cnt> таких пар в тестовом файле

  Examples: Close Paires
  | firstW          | secondW   | cnt |
  | передача        | кандидату | 2   |
  | Федеральных     | законов   | 3   |
  | избирательного  | фонда     | 5   |
  | пятисот         | десяти    | 0   |
  | передача        | группе    | 0   |

Scenario Outline: поиск слов на большом расстоянии
  Given подготовили тестовый файл "stat_141_1.txt"
  When ищем пару слов "<firstW>" и "<secondW>" на расстоянии 500
  Then находим <cnt> таких пар в тестовом файле

  Examples: Distant Paires
  | firstW     | secondW      | cnt |
  | в          | ФЗ           | 5   |
  | инициативы | восьмидесяти | 1   |
  | лишением   | средств      | 2   |
  | передача   | миллиона     | 1   |


Scenario Outline: поиск слов, не встречавшихся в тексте
  Given подготовили тестовый файл "stat_141_1.txt"
  When ищем пару слов "<firstW>" и "<secondW>" на расстоянии 1000
  Then находим 0 таких пар в тестовом файле

  Examples: Distant Paires
  | firstW     | secondW  | 
  | возможный  | счет     |
  | огрничение | работ    |
  | прямо      | слева    |
  | денежных   | вложений |


